package com.spc.base.error


/**
 * The class Error code enum.
 *
 * @author paascloud.net @gmail.com
 */
enum class ErrorCodeEnum(
        private val code: Int,
        private val msg: String
) {
    // 网关相关
    GTW10011(400,"请求被头检测过滤器拦截，请检查头部信息"),
    GTW10012(401,"请求AUTHORIZATION认证为空"),
    GTW10013(400,"解析header后用户名不存在"),
    GTW10014(404,"用户不存在访问该页面的权限"),
    GTW10015(401,"请求被权限检测过滤器拦截，查询权限发生错误"),
    GTW10016(400,"deviceId不能为空"),
    GTW10017(401,"用户不存在访问权限"),

    // 图片服务器相关
    IMG10100(500,"下载图片发生io异常,详情=%s"),
    IMG10101(400,"上传文件不能为空"),
    IMG10102(500,"上传失败,详情=%s"),
    IMG10103(500,"服务器找不到要下载的图片"),
    IMG10104(500,"传输文件发生io异常"),
    IMG10105(400,"更新图片的id不能为空"),

    // app安全相关
    UAC10011002(400, "用户未注册,account = %s"),
    UAC10011003(400, "找不到用户,userId = %s"), // -------------
    UAC10011005(400, "找不到用户,mobile = %s"), //===============
    UAC10011006(400, "手机号不能为空"),
    UAC10011008(400, "新密码不能为空"),
    UAC10011011(400, "用户不存在"),  //--------------------
    UAC10011013(400, "手机号已存在"),
    UAC10011014(400, "新手机号与原手机号一致"),
    UAC10011016(400, "用户名或密码错误"),
    UAC10011019(400, "邮箱已存在"),
    UAC10011020(400, "新邮箱与原邮箱一致"),
    UAC10011021(406, "验证码对象转换为实体失败"),
    UAC10011026(400, "更新用户失败, user=%"), //-------------------
    UAC10011032(400, "邮箱不存在"),  //================
    UAC10011033(400, "密码输入错误"), // -------------
    UAC10011035(400, "原始密码输入错误"),
    UAC10011036(400, "新密码和原始密码不能相同"),
    UAC10011039(406, "验证token失败"),
    UAC10011040(406, "解析header失败"),
    UAC10012009(406, "解析username失败"),
    UAC10015011(400, "用户插入数据库失败, 详情： %s"), // -------------------
    UAC10015012(400, "邮箱激活状态时更新数据库失败, 邮箱： %s"), //---------------
    UAC10015013(400, "当前第三方帐号已绑定"),
    UAC10015016(400, "providerId错误"),
    UAC10015017(400, "手机号格式不正确"),
    UAC10015018(400, "该用户已绑定第三方%s账号"),
    UAC10015019(400, "该手机号：%s未注册"), //-------------------
    UAC10015020(400, "验证码错误"),  //--------------------
    UAC10015021(500, "用户信息未修改成功"),
    UAC10015022(400, "该用户未注册"),
    UAC10015023(400, "未查到该uuid对应用户"),  // ------------------
    UAC10015024(400, "该用户还未绑定第三方%s账号"),
    UAC10015025(400, "验证码不存在或已过期"),  //--------------------
    UAC10015026(400, "此%s已注册"),   //-------------------
    UAC10015027(400, "未成功获取token"),
    UAC10015028(400, "获取uuid失败"), // --------------
    UAC10015029(400, "获取deviceId失败"), // --------------
    UAC10011041(401, "页面已过期,请重新登录"),
    // 全局
    GL99990100(500, "参数异常"),
    GL99990401(401, "无访问权限"),
    GL9999404(404, "找不到指定资源");

    /**
     * Msg string.
     *
     * @return the string
     */
    fun msg(): String {
        return msg
    }

    /**
     * Code int.
     *
     * @return the int
     */
    fun code(): Int {
        return code
    }

    companion object {

        /**
         * Gets enum.
         *
         * @param code the code
         *
         * @return the enum
         */
        fun getEnum(code: Int): ErrorCodeEnum? {
            values().forEach {
                if (it.code == code) return it
            }
            return null
        }
    }
}
