package com.spc.base.error


enum class FileErrorCodeEnum(
        private val code: Int,
        private val msg: String
) {


    FL10020001(10020001, "文件不存在或已过期"),

    FL10020002(10020002, "该文件夹中已存在相同文件"),

    FL10020004(10020004, "protobuf消息为空"),

    FL10020005(10020005, "protobuf消息头为空"),

    FL10020006(10020006, "protobuf消息体为空"),

    FL10020007(10020007, "protobuf消息反序列化失败"),

    FL10020008(10020008, "非法protobuf消息"),

    FL10020009(10020009, "已下载文件长度与服务所传文件长度不对等"),

    FL10020010(10020010, "暂无可用的文件服务器"),

    FL10020012(10020012, "临时文件夹初始化失败"),

    FL10020014(10020014, "文件已上传大小超过文件总大小，文件: %s"),

    FL10020015(10020015, "服务器内部文件读写异常"),

    FL10020016(10020016, "上传文件块大小不符合规则"),

    FL10020017(10020017, "文件信息列表中存在空值"),

    FL10020018(10020018, "新建文件夹失败，已存在相同文件夹名"),

    FL10020019(10020019, "存储文件失败，指定文件夹不存在"),

    FL10020023(10020023, "当前文件夹中已存在相同文件名"),

    FL10020024(10020024, "待移动或复制文件夹不存在"),

    FL10020025(10020025, "待移动或复制文件夹中存在相同文件名"),

    FL10020027(10020027, "文件删除失败， 文件不存在"),

    FL10020029(10020029, "新建文件夹失败，父目录不存在"),

    FL10020030(10020030, "删除文件夹失败，文件夹内数量超过500，请输入密码确认删除"),

    FL10020031(10020031, "删除文件夹失败，鉴权失败"),

    FL10020032(10020032, "重命名文件夹失败，当前目录已存在相同文件夹名"),

    FL10020034(10020034, "待存储文件不存在"),

    FL10020035(10020035, "存储文件入数据库失败"),

    FL10020036(10020036, "数据库中不存在此文件"),

    FL10020037(10020037, "文件断点信息不存在"),

    FL10020038(10020038, "文件断点不存在"),

    FL10020039(10020039, "处理文件断点失败"),

    FL10020040(10020040, "断点文件已损坏"),

    FL10020041(10020041, "删除文件夹失败，文件夹内文件数量过大，请从子目录内进行删除"),

    FL10020042(10020042, "清除文件失败，待清除文件不存在"),

    FL10020043(10020043, "找回文件失败，待找回文件为未删除状态"),

    FL10020044(10020044, "找回文件失败，指定目录不存在"),

    FL10020045(10020045, "找回文件失败，指定目录中存在相同文件名"),

    FL10020046(10020046, "删除文件失败，该文件已删除"),

    FL10020048(10020048, "删除文件夹失败，该文件夹已删除"),

    FL10020049(10020049, "删除文件夹失败，该文件夹不存在"),

    FL10020050(10020050, "重命名文件夹失败，该文件夹已删除"),

    FL10020055(10020055, "移动或复制文件失败，移动的目标文件夹已删除"),

    FL10020056(10020056, "清除文件夹失败，文件夹不存在"),

    FL10020057(10020057, "清除文件夹失败，文件夹为未删除状态"),

    FL10020058(10020058, "清除文件失败，待清除文件为未删除状态"),

    FL10020059(10020059, "找回文件失败，指定目标文件夹已删除"),

    FL10020060(10020060, "拷贝文件数目过多"),

    FL10020061(10020061, "拷贝文件内容过大"),

    FL10020062(10020062, "待拷贝文件不存在"),

    FL10020063(10020063, "FTP上传文件失败"),

    FL10020064(10020064, "FTP删除文件失败"),
    FL10020070(10020070, "不能移动到自身子目录下"),

    MG10050001(10050001, "CHANNEL不存在"),

    MG10020065(10020065, "重命名失败，指定文件夹存在"),

    MG10020066(10020066, "非法请求，当前项目下不存在该用户"),

    MG10020067(10020067, "request banned"),

    MG10020068(10020068, "不支持预览"),

    MG10020069(10020069, "请使用客户端下载")
    ;



    /**
     * Msg string.
     *
     * @return the string
     */
    fun msg(): String {
        return msg
    }

    /**
     * Code int.
     *
     * @return the int
     */
    fun code(): Int {
        return code
    }

    companion object {

        /**
         * Gets enum.
         *
         * @param code the status
         *
         * @return the enum
         */
        fun getEnum(code: Int?): FileErrorCodeEnum? {
            if (code == null) return null
            values().forEach {
                if (it.code == code) return it
            }
            return null
        }
    }
}